zerobinhi/STM32F103CBT6-SmartGate/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dma.h"
#include "i2c.h"
#include "rtc.h"
#include "stm32f1xx_hal.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "fm225.h"
#include "oled.h"
#include <stdint.h>
#include <stdio.h>
#include <string.h>

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
uint8_t KEY0_PRESSED = 0;
uint8_t KEY1_PRESSED = 0;
uint8_t KEY2_PRESSED = 0;
uint8_t KEY3_PRESSED = 0;
uint8_t g_user_name = 1;
uint8_t g_delete_id = 1;

int menu_main();
int menu_enroll();
int menu_verify();
int menu_delete();
void OLED_ShowTime();
int (*menu)() = &menu_main;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C1_Init();
  MX_RTC_Init();
  MX_USART1_UART_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */
  rtc_init_user();                             // RTC初始化
  __HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE); // 使能串口IDLE中断
  HAL_UARTEx_ReceiveToIdle_DMA(&huart1, (uint8_t *)RX_BUFFER, RX_BUFF_SIZE);
  HAL_TIM_Base_Start_IT(&htim1); // 按键消抖

  if (OLED_Init() != HAL_OK) // OLED初始化
  {
    Error_Handler();
  }
  OLED_ShowTime(); // 显示时间
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1) {
    if (KEY1_PRESSED == 1) {
      menu = menu_main;
    }
    if (KEY3_PRESSED == 1) {
      menu = menu_enroll;
    }
    if (KEY2_PRESSED == 1) {
      menu = menu_verify;
    }
    if (KEY0_PRESSED == 1) {
      menu = menu_delete;
    }
    if (menu != NULL) {
      KEY0_PRESSED = 0;
      KEY1_PRESSED = 0;
      KEY2_PRESSED = 0;
      KEY3_PRESSED = 0;
      menu();
    }
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE|RCC_OSCILLATORTYPE_LSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
  PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

// 计算 BCC 异或校验码的函数
uint8_t calculateBCC(uint8_t *data, int length) {
  uint8_t bcc = 0;
  for (int i = 0; i < length; i++) {
    // 对每个字节进行异或操作
    bcc ^= data[i];
  }
  return bcc;
}

int menu_main() {
  menu = NULL;
  OLED_FillRect(0, 16, 128, 64, 0); // 清空2~7行

  OLED_ShowChinese(32, 16, 0, 0);
  OLED_ShowChinese(48, 16, 1, 0);
  OLED_ShowChinese(64, 16, 6, 0);
  OLED_ShowChinese(80, 16, 7, 0);

  OLED_ShowChinese(32, 32, 4, 0);
  OLED_ShowChinese(48, 32, 5, 0);
  OLED_ShowChinese(64, 32, 6, 0);
  OLED_ShowChinese(80, 32, 7, 0);

  OLED_ShowChinese(32, 48, 2, 0);
  OLED_ShowChinese(48, 48, 3, 0);
  OLED_ShowChinese(64, 48, 6, 0);
  OLED_ShowChinese(80, 48, 7, 0);
  OLED_Refresh();
  return 0;
}
int menu_enroll() {
  OLED_FillRect(0, 16, 128, 64, 0); // 清空2~7行

  OLED_ShowChinese(0, 16, 8, 0);   // 再
  OLED_ShowChinese(16, 16, 9, 0);  // 按
  OLED_ShowChinese(32, 16, 10, 0); // 一
  OLED_ShowChinese(48, 16, 11, 0); // 次

  OLED_ShowChinese(64, 16, 0, 0);  // 注
  OLED_ShowChinese(80, 16, 1, 0);  // 册
  OLED_ShowChinese(96, 16, 6, 0);  // 人
  OLED_ShowChinese(112, 16, 7, 0); // 脸

