zerobinhi/STM32F103CBT6-SmartGate/Core/Src/main.c
  OLED_ShowChinese(32, 32, 12, 0); // 序
  OLED_ShowChinese(48, 32, 13, 0); // 号
  OLED_ShowChinese(64, 32, 14, 0); // ：
  OLED_ShowNum(80, 32, g_user_name, 2, 16, 0);
  OLED_Refresh();

  while (1) {
    if (KEY3_PRESSED == 1) {
      KEY3_PRESSED = 0;
      OLED_FillRect(0, 16, 128, 64, 0); // 清空2~7行

      OLED_ShowChinese(40, 16, 0, 0);  // 注
      OLED_ShowChinese(56, 16, 1, 0);  // 册
      OLED_ShowChinese(72, 16, 15, 0); // 中

      OLED_ShowChinese(16, 32, 35, 0); // 设
      OLED_ShowChinese(32, 32, 36, 0); // 备
      OLED_ShowChinese(48, 32, 33, 0); // 正
      OLED_ShowChinese(64, 32, 39, 0); // 在
      OLED_ShowChinese(80, 32, 37, 0); // 连
      OLED_ShowChinese(96, 32, 38, 0); // 接
      OLED_Refresh();

      // 重置 user_buffer 和 user_buffer_len
      user_buffer_len = 0;
      memset(user_buffer, 0x00, sizeof(user_buffer));

      HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                        GPIO_PIN_SET); // 打开FM225的电源
      uint8_t ready_msg[7] = {0XEF, 0XAA, 0X01, 0X00, 0X01, 0X00, 0X00};

      // 等待收到开机准备好的消息
      while (strcmp((const char *)user_buffer, (const char *)ready_msg) != 0) {
        if (KEY2_PRESSED == 1) {
          KEY2_PRESSED = 0;
        }

        if (KEY0_PRESSED == 1) {
          KEY0_PRESSED = 0;
        }
        if (KEY3_PRESSED == 1) {
          KEY3_PRESSED = 0;
        }
        if (KEY1_PRESSED == 1) {
          KEY1_PRESSED = 0;
          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                            GPIO_PIN_RESET); // 关闭FM225的电源
          menu = menu_main;
          return 0;
        }
      }

      uint8_t user_name[32] = {0};
      user_name[0] = g_user_name;
      face_enroll(0x01, user_name, FACE_DIRECTION_UNDEFINED, 0x01, 0x00, 10);

      // 等待收到验证结果
      while (1) {
        if (user_buffer[2] == 0X01 && user_buffer[3] == 0X00 &&
            user_buffer[4] == 0X11 && user_buffer[5] == 0X01 &&
            user_buffer[6] == 0X01) {
          // 重置 user_buffer 和 user_buffer_len
          user_buffer_len = 0;
          memset(user_buffer, 0x00, sizeof(user_buffer));

          OLED_ShowChinese(16, 48, 29, 0); // 未
          OLED_ShowChinese(32, 48, 30, 0); // 检
          OLED_ShowChinese(48, 48, 31, 0); // 测
          OLED_ShowChinese(64, 48, 32, 0); // 到
          OLED_ShowChinese(80, 48, 6, 0);  // 人
          OLED_ShowChinese(96, 48, 7, 0);  // 脸
          OLED_Refresh();
        }
        if (user_buffer[2] == 0X01 && user_buffer[3] == 0X00 &&
            user_buffer[4] == 0X11 && user_buffer[5] == 0X01 &&
            user_buffer[6] == 0X00) {
          // 重置 user_buffer 和 user_buffer_len
          user_buffer_len = 0;
          memset(user_buffer, 0x00, sizeof(user_buffer));

          OLED_Clear(0);; // 清空4~5行

          OLED_ShowChinese(32, 48, 6, 0);  // 人
          OLED_ShowChinese(48, 48, 7, 0);  // 脸
          OLED_ShowChinese(64, 48, 33, 0); // 正
          OLED_ShowChinese(80, 48, 34, 0); // 常
          OLED_Refresh();
        }
        if ((user_buffer[2] == 0X00) && (user_buffer[5] == CMD_ENROLL_ITG) &&
            (user_buffer[6] == 0X0A)) {

          user_buffer_len = 0;
          memset(user_buffer, 0x00, sizeof(user_buffer));

          // 播放人脸已录入语音
          HAL_GPIO_WritePin(IO3_GPIO_Port, IO3_Pin, GPIO_PIN_RESET);

          // 关闭FM225的电源
          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin, GPIO_PIN_RESET);
          OLED_FillRect(0, 16, 128, 64, 0); // 清空2~7行

          OLED_ShowChinese(24, 32, 6, 0);  // 人
          OLED_ShowChinese(40, 32, 7, 0);  // 脸
          OLED_ShowChinese(56, 32, 20, 0); // 已
          OLED_ShowChinese(72, 32, 21, 0); // 录
          OLED_ShowChinese(88, 32, 22, 0); // 入
          OLED_Refresh();

          while (1) {
            if (KEY3_PRESSED == 1) {
              KEY3_PRESSED = 0;
            }
            if (KEY2_PRESSED == 1) {
              KEY2_PRESSED = 0;
            }

            if (KEY0_PRESSED == 1) {
              KEY0_PRESSED = 0;
            }
            if (KEY1_PRESSED == 1) {
              KEY1_PRESSED = 0;
              HAL_GPIO_WritePin(IO3_GPIO_Port, IO3_Pin, GPIO_PIN_SET);
              menu = menu_main;
              return 0;
            }
          }
        } else if ((user_buffer[2] == 0X00) &&
                   (user_buffer[5] == CMD_ENROLL_ITG) &&
                   (user_buffer[6] == 0X00) && (user_buffer[8] != 0X00)) {

          // 重置 user_buffer 和 user_buffer_len
          user_buffer_len = 0;
          memset(user_buffer, 0x00, sizeof(user_buffer));

          // 播放录入成功语音
          HAL_GPIO_WritePin(IO1_GPIO_Port, IO1_Pin, GPIO_PIN_RESET);

          // 关闭FM225的电源
          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin, GPIO_PIN_RESET);
          OLED_Clear(0);           // 清空2~7行
          OLED_ShowChinese(32, 32, 21, 0); // 录
          OLED_ShowChinese(48, 32, 22, 0); // 入
          OLED_ShowChinese(64, 32, 16, 0); // 成
          OLED_ShowChinese(80, 32, 17, 0); // 功
          OLED_Refresh();

          while (1) {
            if (KEY3_PRESSED == 1) {
              KEY3_PRESSED = 0;
            }
            if (KEY2_PRESSED == 1) {
              KEY2_PRESSED = 0;
            }

            if (KEY0_PRESSED == 1) {
              KEY0_PRESSED = 0;
            }
            if (KEY1_PRESSED == 1) {
              KEY1_PRESSED = 0;
              HAL_GPIO_WritePin(IO1_GPIO_Port, IO1_Pin, GPIO_PIN_SET);
              menu = menu_main;
              return 0;
            }
          }
        } else if ((user_buffer[2] == 0X00) &&
                   (user_buffer[5] == CMD_ENROLL_ITG) &&
                   (user_buffer[6] == 0X0D)) {

          // 重置 user_buffer 和 user_buffer_len
          user_buffer_len = 0;
          memset(user_buffer, 0x00, sizeof(user_buffer));

          // 播放录入失败语音
          HAL_GPIO_WritePin(IO2_GPIO_Port, IO2_Pin, GPIO_PIN_RESET);

          // 关闭FM225的电源
          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin, GPIO_PIN_RESET);
          OLED_FillRect(0, 16, 128, 64, 0); // 清空2~7行
          OLED_ShowChinese(32, 32, 21, 0);
          OLED_ShowChinese(48, 32, 22, 0);
          OLED_ShowChinese(64, 32, 18, 0);
          OLED_ShowChinese(80, 32, 19, 0);
          OLED_Refresh();

          while (1) {
            if (KEY3_PRESSED == 1) {
              KEY3_PRESSED = 0;
            }
            if (KEY2_PRESSED == 1) {
              KEY2_PRESSED = 0;
            }

            if (KEY0_PRESSED == 1) {
              KEY0_PRESSED = 0;
            }
            if (KEY1_PRESSED == 1) {
              KEY1_PRESSED = 0;
              menu = menu_main;
              return 0;
            }
          }
        }
        if (KEY2_PRESSED == 1) {
          KEY2_PRESSED = 0;
        }
        if (KEY3_PRESSED == 1) {
          KEY3_PRESSED = 0;
        }
        if (KEY0_PRESSED == 1) {
          KEY0_PRESSED = 0;
        }
        if (KEY1_PRESSED == 1) {
          KEY1_PRESSED = 0;
          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                            GPIO_PIN_RESET); // 关闭FM225的电源
          menu = menu_main;
          return 0;
        }
      }
    }
    if (KEY2_PRESSED == 1) {
      KEY2_PRESSED = 0;
      if (g_user_name < 99) {
        g_user_name++;
        OLED_ShowNum(80, 32, g_user_name, 2, 16, 0);
        OLED_Refresh();
      }
    }
    if (KEY0_PRESSED == 1) {
      KEY0_PRESSED = 0;
      if (g_user_name > 1) {
        g_user_name--;
        OLED_ShowNum(80, 32, g_user_name, 2, 16, 0);
        OLED_Refresh();
      }
    }
    if (KEY1_PRESSED == 1) {

