zerobinhi/STM32F103CBT6-SmartGate/Core/Src/main.c
      KEY1_PRESSED = 0;
      HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                        GPIO_PIN_RESET); // 关闭FM225的电源
      menu = menu_main;
      return 0;
    }
  }
}
int menu_verify() {
  while (1) {

    OLED_FillRect(0, 16, 128, 64, 0); // 清空2~7行

    OLED_ShowChinese(16, 16, 35, 0); // 设
    OLED_ShowChinese(32, 16, 36, 0); // 备
    OLED_ShowChinese(48, 16, 33, 0); // 正
    OLED_ShowChinese(64, 16, 39, 0); // 在
    OLED_ShowChinese(80, 16, 37, 0); // 连
    OLED_ShowChinese(96, 16, 38, 0); // 接
    OLED_Refresh();

    // 重置 user_buffer 和 user_buffer_len
    user_buffer_len = 0;
    memset(user_buffer, 0x00, sizeof(user_buffer));

    HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin, GPIO_PIN_SET);

    uint8_t ready_msg[7] = {0XEF, 0XAA, 0X01, 0X00, 0X01, 0X00, 0X00};

    // 等待收到开机准备好的消息
    while (strcmp((const char *)user_buffer, (const char *)ready_msg) != 0) {
      if (KEY2_PRESSED == 1) {
        KEY2_PRESSED = 0;
      }

      if (KEY0_PRESSED == 1) {
        KEY0_PRESSED = 0;
      }
      if (KEY3_PRESSED == 1) {
        KEY3_PRESSED = 0;
      }
      if (KEY1_PRESSED == 1) {
        KEY1_PRESSED = 0;
        HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                          GPIO_PIN_RESET); // 关闭FM225的电源
        menu = menu_main;
        return 0;
      }
    }

    // 调用验证函数
    face_verify(0x01, 10);

    while (1) {
      if (user_buffer[2] == 0X01 && user_buffer[3] == 0X00 &&
          user_buffer[4] == 0X11 && user_buffer[5] == 0X01 &&
          user_buffer[6] == 0X01) {
        // 重置 user_buffer 和 user_buffer_len
        user_buffer_len = 0;
        memset(user_buffer, 0x00, sizeof(user_buffer));

        OLED_ShowChinese(16, 32, 29, 0); // 未
        OLED_ShowChinese(32, 32, 30, 0); // 检
        OLED_ShowChinese(48, 32, 31, 0); // 测
        OLED_ShowChinese(64, 32, 32, 0); // 到
        OLED_ShowChinese(80, 32, 6, 0);  // 人
        OLED_ShowChinese(96, 32, 7, 0);  // 脸
        OLED_Refresh();
      }
      if (user_buffer[2] == 0X01 && user_buffer[3] == 0X00 &&
          user_buffer[4] == 0X11 && user_buffer[5] == 0X01 &&
          user_buffer[6] == 0X00) {
        // 重置 user_buffer 和 user_buffer_len
        user_buffer_len = 0;
        memset(user_buffer, 0x00, sizeof(user_buffer));

        OLED_Clear(0); // 清空2~3行

        OLED_ShowChinese(32, 32, 6, 0);  // 人
        OLED_ShowChinese(48, 32, 7, 0);  // 脸
        OLED_ShowChinese(64, 32, 33, 0); // 正
        OLED_ShowChinese(80, 32, 34, 0); // 常
        OLED_Refresh();
      }

      if (user_buffer[2] == 0X00 && user_buffer[5] == CMD_VERIFY_FACE &&
          user_buffer[6] == 0X00 && user_buffer[8] != 0X00) {

        HAL_GPIO_WritePin(IO5_GPIO_Port, IO5_Pin,
                          GPIO_PIN_RESET); // 播放验证成功语音

        HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                          GPIO_PIN_RESET); // 关闭FM225电源

        // 重置 user_buffer 和 user_buffer_len
        user_buffer_len = 0;
        memset(user_buffer, 0x00, sizeof(user_buffer));

        uint8_t id = user_buffer[8];
        OLED_ShowNum(72, 16, user_buffer[8], 2, 16, 0);
        OLED_Refresh();

        OLED_Clear(0);           // 清空2~3行
        OLED_ShowChinese(32, 16, 2, 0);  // 验
        OLED_ShowChinese(48, 16, 3, 0);  // 证
        OLED_ShowChinese(64, 16, 16, 0); // 成
        OLED_ShowChinese(80, 16, 17, 0); // 功

        OLED_ShowChinese(24, 32, 25, 0); // 库
        OLED_ShowChinese(40, 32, 26, 0); // 中
        OLED_ShowChinese(56, 32, 27, 0); // 第
        OLED_ShowNum(72, 32, id, 2, 16, 0);
        OLED_ShowChinese(88, 32, 28, 0); // 个
        OLED_Refresh();
      }
      if (user_buffer[2] == 0X00 && user_buffer[5] == CMD_VERIFY_FACE &&
          user_buffer[6] == 0X0D) {

        HAL_GPIO_WritePin(IO6_GPIO_Port, IO6_Pin,
                          GPIO_PIN_RESET); // 播放验证失败语音
        HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                          GPIO_PIN_RESET); // 关闭FM225电源

        // 重置 user_buffer 和 user_buffer_len
        user_buffer_len = 0;
        memset(user_buffer, 0x00, sizeof(user_buffer));

        OLED_Clear(0);           // 清空2~3行
        OLED_ShowChinese(32, 16, 2, 0);  // 验
        OLED_ShowChinese(48, 16, 3, 0);  // 证
        OLED_ShowChinese(64, 16, 18, 0); // 失
        OLED_ShowChinese(80, 16, 19, 0); // 败
      }
      if (KEY2_PRESSED == 1) {
        KEY2_PRESSED = 0;
      }

      if (KEY0_PRESSED == 1) {
        KEY0_PRESSED = 0;
      }
      if (KEY3_PRESSED == 1) {
        KEY3_PRESSED = 0;
      }
      if (KEY1_PRESSED == 1) {
        KEY1_PRESSED = 0;
        HAL_GPIO_WritePin(IO5_GPIO_Port, IO5_Pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(IO6_GPIO_Port, IO6_Pin, GPIO_PIN_SET);
        HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin, GPIO_PIN_RESET);
        menu = menu_main;
        return 0;
      }
    }
  }
}
int menu_delete() {

  OLED_FillRect(0, 16, 128, 64, 0); // 清空2~7行

  OLED_ShowChinese(0, 16, 8, 0);   // 再
  OLED_ShowChinese(16, 16, 9, 0);  // 按
  OLED_ShowChinese(32, 16, 10, 0); // 一
  OLED_ShowChinese(48, 16, 11, 0); // 次

  OLED_ShowChinese(64, 16, 4, 0);  // 注
  OLED_ShowChinese(80, 16, 5, 0);  // 册
  OLED_ShowChinese(96, 16, 6, 0);  // 人
  OLED_ShowChinese(112,16, 7, 0); // 脸

  OLED_ShowChinese(24, 32, 25, 0); // 库
  OLED_ShowChinese(40, 32, 26, 0); // 中
  OLED_ShowChinese(56, 32, 27, 0); // 第
  OLED_ShowNum(72, 32, g_delete_id, 2, 16, 0);
  OLED_ShowChinese(88, 32, 28, 0); // 个
  OLED_Refresh();

  while (1) {
    if (KEY0_PRESSED == 1) {
      KEY0_PRESSED = 0;

      // 重置 user_buffer 和 user_buffer_len
      user_buffer_len = 0;
      memset(user_buffer, 0x00, sizeof(user_buffer));

      HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                        GPIO_PIN_SET); // 打开FM225的电源
      uint8_t ready_msg[7] = {0XEF, 0XAA, 0X01, 0X00, 0X01, 0X00, 0X00};

      // 等待收到开机准备好的消息
      while (strcmp((const char *)user_buffer, (const char *)ready_msg) != 0) {
        if (KEY2_PRESSED == 1) {
          KEY2_PRESSED = 0;
        }

        if (KEY0_PRESSED == 1) {
          KEY0_PRESSED = 0;
        }
        if (KEY3_PRESSED == 1) {
          KEY3_PRESSED = 0;
        }
        if (KEY1_PRESSED == 1) {
          KEY1_PRESSED = 0;
          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                            GPIO_PIN_RESET); // 关闭FM225的电源
          menu = menu_main;
          return 0;
        }
      }

      if (g_delete_id == 0) {
        face_delete_all();

      } else {
        face_delete_user(g_delete_id);
      }
      while (1) {

