zerobinhi/STM32F103CBT6-SmartGate/Core/Src/main.c
        if (user_buffer[2] == 0X00 && user_buffer[5] == CMD_DELETE_USER &&
            user_buffer[6] == 0X00) {

          // 重置 user_buffer 和 user_buffer_len
          user_buffer_len = 0;
          memset(user_buffer, 0x00, sizeof(user_buffer));

          // 播放删除成功语音
          HAL_GPIO_WritePin(IO7_GPIO_Port, IO7_Pin, GPIO_PIN_RESET);

          OLED_Clear(0); // 清空2~5行

          OLED_ShowChinese(32, 16, 4, 0);  // 删
          OLED_ShowChinese(48, 16, 5, 0);  // 除
          OLED_ShowChinese(64, 16, 16, 0); // 成
          OLED_ShowChinese(80, 16, 17, 0); // 功
          OLED_Refresh();

          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                            GPIO_PIN_RESET); // 关闭FM225的电源
        }

        if (user_buffer[2] == 0X00 && user_buffer[5] == CMD_DELETE_FACE &&
            user_buffer[6] == 0X00) {

          // 重置 user_buffer 和 user_buffer_len
          user_buffer_len = 0;
          memset(user_buffer, 0x00, sizeof(user_buffer));

          // 播放删除成功语音
          HAL_GPIO_WritePin(IO7_GPIO_Port, IO7_Pin, GPIO_PIN_RESET);

          OLED_Clear(0); // 清空2~5行

          OLED_ShowChinese(32, 16, 4, 0);  // 删
          OLED_ShowChinese(48, 16, 5, 0);  // 除
          OLED_ShowChinese(64, 16, 16, 0); // 成
          OLED_ShowChinese(80, 16, 17, 0); // 功
          OLED_Refresh();

          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin,
                            GPIO_PIN_RESET); // 关闭FM225的电源
        }

        if (KEY3_PRESSED == 1) {
          KEY3_PRESSED = 0;
        }

        if (KEY2_PRESSED == 1) {
          KEY2_PRESSED = 0;
        }

        if (KEY0_PRESSED == 1) {
          KEY0_PRESSED = 0;
        }
        if (KEY1_PRESSED == 1) {
          KEY1_PRESSED = 0;
          HAL_GPIO_WritePin(IO7_GPIO_Port, IO7_Pin, GPIO_PIN_SET);
          HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin, GPIO_PIN_RESET); // 关闭FM225的电源
          menu = menu_main;
          return 0;
        }
      }
    }
    if (KEY3_PRESSED == 1) {
      KEY3_PRESSED = 0;
      if (g_delete_id < 99) {
        g_delete_id++;
        OLED_ShowNum(72, 32, g_delete_id, 2, 16, 0);
        OLED_Refresh();
      }
    }
    if (KEY2_PRESSED == 1) {
      KEY2_PRESSED = 0;
      if (g_delete_id > 0) {
        g_delete_id--;
        OLED_ShowNum(72, 32, g_delete_id, 2, 16, 0);
        OLED_Refresh();
      }
    }
    if (KEY1_PRESSED == 1) {
      KEY1_PRESSED = 0;
      HAL_GPIO_WritePin(FM225_CTL_GPIO_Port, FM225_CTL_Pin, GPIO_PIN_RESET);
      menu = menu_main;
      return 0;
    }
  }
}
void OLED_ShowTime(void) {
  char buf[50]; // 存放 "YYYY-MM-DD HH:MM"

  /* 获取 RTC 当前时间和日期 */
  RTC_GetTime();

  /* 格式化日期 + 时分 */
  memset(buf, 0, sizeof(buf));
  sprintf(buf, "%04d-%02d-%02d %02d:%02d", date_info[0], date_info[1],
          date_info[2], date_info[3], date_info[4]);

  /* 显示在 OLED 第一行 */
  OLED_ShowString(0, 0, buf, 16, 0);
  OLED_Refresh();
}

/* 定时器中断回调函数 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
  if (htim->Instance == TIM1) {
    /* 停止定时器 */
    HAL_TIM_Base_Stop_IT(&htim1);

    /* 读取按键状态 */
    if (HAL_GPIO_ReadPin(KEY0_GPIO_Port, KEY0_Pin) == GPIO_PIN_RESET) {
      KEY0_PRESSED = 1;
    }
    if (HAL_GPIO_ReadPin(KEY1_GPIO_Port, KEY1_Pin) == GPIO_PIN_RESET) {
      KEY1_PRESSED = 1;
    }
    if (HAL_GPIO_ReadPin(KEY2_GPIO_Port, KEY2_Pin) == GPIO_PIN_RESET) {
      KEY2_PRESSED = 1;
    }
    if (HAL_GPIO_ReadPin(KEY3_GPIO_Port, KEY3_Pin) == GPIO_PIN_RESET) {
      KEY3_PRESSED = 1;
    }
  }
}
// 外部中断回调函数
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
  // 检查是否为有效按键引脚
  if (GPIO_Pin == KEY0_Pin || GPIO_Pin == KEY1_Pin || GPIO_Pin == KEY2_Pin ||
      GPIO_Pin == KEY3_Pin) {
    // 清除定时器计数并启动定时器
    __HAL_TIM_SET_COUNTER(&htim1, 0);
    HAL_TIM_Base_Start_IT(&htim1);
  }
}
// UART接收事件回调函数
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size) {
  if (huart->Instance == USART1) {

    HAL_UART_DMAStop(&huart1);

    // 保存数据
    memcpy(user_buffer, RX_BUFFER, Size);

    user_buffer_len = Size;

    // 再清空
    memset(RX_BUFFER, 0x00, sizeof(RX_BUFFER));

    HAL_UARTEx_ReceiveToIdle_DMA(&huart1, RX_BUFFER, RX_BUFF_SIZE);
  }
}
// RTC秒中断回调函数
void HAL_RTCEx_RTCEventCallback(RTC_HandleTypeDef *hrtc) { OLED_ShowTime(); }
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
